In [123]:
#Método GroupBy
import pandas as pd
import os
print(os.getcwd())

c:\Users\Giovana Cristina\Documents\estudossData\EstudosArea\Manipulaçao-Dados

In [124]:
df = pd.read_csv(r"alunos.csv")

In [125]:
df.head()

      nome  idade  nota      série   situacao
0      Ana     16  5.38  2º ano EM  Reprovado
1    Bruno     15  9.72     7º ano   Aprovado
2   Carlos     14  7.26  2º ano EM   Aprovado
3  Daniela     16  5.41  2º ano EM  Reprovado
4  Eduardo     12  5.52  1º ano EM  Reprovado

1 - Quantidade de aluno por série

In [126]:
#Função GroupBy
df.groupby(['série'])['série'].count() 
#Coluna para agrupar as informações, 
#ao executar ele vai mostrar quantos alunos tem em cada série, 
#coloquei nome duas vezes porque é apenas uma coluna e não duas

série
1º ano EM    2
2º ano EM    5
3º ano EM    2
6º ano       1
7º ano       1
8º ano       5
9º ano       4
Name: série, dtype: int64

In [127]:
#Fução AGG
df.groupby(['série'])['série'].agg('count') 
#Multiplas operações de uma forma mais fácil 
#Função AGG + GroupBy

série
1º ano EM    2
2º ano EM    5
3º ano EM    2
6º ano       1
7º ano       1
8º ano       5
9º ano       4
Name: série, dtype: int64

2- Média de idade por situação e série (Múltiplas colunas)

In [128]:
df.groupby(['situacao', 'série'])['idade'].agg('mean')
#Vai mostrar a média de idade dos alunos aprovados e reprovados em cada série
#Vou agrupar as colunas situação e série e mostrar a média em cada um deles

situacao   série
Aprovado   2º ano EM    15.500000
           3º ano EM    11.000000
           6º ano       17.000000
           7º ano       15.000000
           8º ano       13.000000
           9º ano       11.000000
Reprovado  1º ano EM    12.500000
           2º ano EM    16.333333
           3º ano EM    11.000000
           8º ano       14.666667
           9º ano       12.000000
Name: idade, dtype: float64

3- Número de alunos por série e média de notas (Múltiplas funções)

In [129]:
df.groupby(['série']).agg({'nome':'count', 'nota': 'mean','idade':'mean'})
#Quase sempre quando na requisição tem  "por" é um groupby(agrupamento) na tabela depois do 'por'
#Pode colocar quantas colunas e associações quiser associadas a coluna 'série'(coluna principal)
#Vai mostrar a quantidade de alunos em cada série e a média total deles
#Por último adicionei a coluna idade então vai mostrar a média de idade dos alunos em cada série

           nome   nota  idade
série
1º ano EM     2  5.725  12.50
2º ano EM     5  6.590  16.00
3º ano EM     2  6.505  11.00
6º ano        1  7.300  17.00
7º ano        1  9.720  15.00
8º ano        5  7.442  14.00
9º ano        4  6.510  11.75

4- Calcular a média, o máximo e o mínimo de idade por sala

In [130]:
df.groupby(['série'])['idade'].agg(['mean', 'max', 'min'])
#Passo a tabela principal 'série' e desejo saber a média da idade(tabela de agregação) total, a idade máxima e mínima dos alunos de cada série

            mean  max  min
série
1º ano EM  12.50   13   12
2º ano EM  16.00   17   14
3º ano EM  11.00   11   11
6º ano     17.00   17   17
7º ano     15.00   15   15
8º ano     14.00   18   11
9º ano     11.75   13   11

5- Agregando sem agrupar

In [131]:
df.agg({'idade':['mean', 'min'], 'nota':['min', 'max']})
#Agregação direta, sem agrupar
#Útil para quando quer ter uma visão geral das estatísticas globais de uma coluna específica
#Na minha coluna de idade vai mostrar o total e o mínimo e na de nota vai mostrar o mínimo e o máximo, sem comparar
#Serão medidas individualmente

      idade  nota
mean   13.8   NaN
min    11.0  5.06
max     NaN  9.72

In [132]:
#Salvando os dados em um dataframe
caminho_excel = r"C:\\Users\\Giovana Cristina\Documents\\estudossData\\EstudosArea\\Estudos Python\\estatisticaAlunos.xlsx"

df.to_excel(caminho_excel, index = False)
print ("Arquivo excel salvo com sucesso")

Arquivo excel salvo com sucesso